       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD.
       
       ENVIRONMENT DIVISION.
       
       DATA DIVISION.
       
       WORKING-STORAGE SECTION.
           01 WS-NAME PIC X(20).
           01 WS-MESSAGE PIC X(50).
       
       PROCEDURE DIVISION.
           MOVE "WORLD" TO WS-NAME.
           MOVE "HELLO, " TO WS-MESSAGE.
           DISPLAY WS-MESSAGE WS-NAME.
           STOP RUN. 